## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.hub.azurerm_resource_group.hubResourceGroup will be created
  + resource "azurerm_resource_group" "hubResourceGroup" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-erictfpoc-hub-dev-eus"
    }

  # module.hub.random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.spoke.data.azurerm_subnet.appGatewaySubnet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "appGatewaySubnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "snet-agw"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "rg-erictfpoc-spoke-dev-eus"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "vnet-erictfpoc-dev-eus-spoke"
    }

  # module.spoke.data.azurerm_subnet.infraSubnet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "infraSubnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "snet-infra"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "rg-erictfpoc-spoke-dev-eus"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "vnet-erictfpoc-dev-eus-spoke"
    }

  # module.spoke.data.azurerm_subnet.jumpboxSubnet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "jumpboxSubnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "snet-jumpbox"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "rg-erictfpoc-spoke-dev-eus"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "vnet-erictfpoc-dev-eus-spoke"
    }

  # module.spoke.data.azurerm_subnet.privateEndpointsSubnet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "privateEndpointsSubnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "snet-pep"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "rg-erictfpoc-spoke-dev-eus"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "vnet-erictfpoc-dev-eus-spoke"
    }

  # module.spoke.azurerm_resource_group.spokeResourceGroup will be created
  + resource "azurerm_resource_group" "spokeResourceGroup" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-erictfpoc-spoke-dev-eus"
    }

  # module.spoke.azurerm_subnet_network_security_group_association.agwSecurityGroupAssociation[0] will be created
  + resource "azurerm_subnet_network_security_group_association" "agwSecurityGroupAssociation" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.spoke.azurerm_subnet_network_security_group_association.infraSecurityGroupAssociation will be created
  + resource "azurerm_subnet_network_security_group_association" "infraSecurityGroupAssociation" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.spoke.azurerm_subnet_network_security_group_association.jumpBoxSecurityGroupAssociation[0] will be created
  + resource "azurerm_subnet_network_security_group_association" "jumpBoxSecurityGroupAssociation" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.spoke.azurerm_subnet_network_security_group_association.privateEndpointSecurityGroupAssociation will be created
  + resource "azurerm_subnet_network_security_group_association" "privateEndpointSecurityGroupAssociation" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.spoke.random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.hub.module.bastion.azurerm_bastion_host.bastionHost will be created
  + resource "azurerm_bastion_host" "bastionHost" {
      + copy_paste_enabled        = true
      + dns_name                  = (known after apply)
      + file_copy_enabled         = false
      + id                        = (known after apply)
      + ip_connect_enabled        = false
      + kerberos_enabled          = false
      + location                  = "eastus"
      + name                      = "bas-dev-eus"
      + resource_group_name       = "rg-erictfpoc-hub-dev-eus"
      + scale_units               = 2
      + session_recording_enabled = false
      + shareable_link_enabled    = false
      + sku                       = "Basic"
      + tunneling_enabled         = false

      + ip_configuration {
          + name                 = "ipconf"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.hub.module.bastion.azurerm_public_ip.bastionPip will be created
  + resource "azurerm_public_ip" "bastionPip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "pip-bas-dev-eus"
      + resource_group_name     = "rg-erictfpoc-hub-dev-eus"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.hub.module.bastion.azurerm_subnet.bastionSubnet will be created
  + resource "azurerm_subnet" "bastionSubnet" {
      + address_prefixes                              = [
          + "10.0.0.128/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureBastionSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-erictfpoc-hub-dev-eus"
      + virtual_network_name                          = "vnet-dev-eus-hub"
    }

  # module.hub.module.bastion.azurerm_subnet_network_security_group_association.bastion will be created
  + resource "azurerm_subnet_network_security_group_association" "bastion" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub.module.diagnostics.data.azurerm_monitor_diagnostic_categories.resources["bastion"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "resources" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.hub.module.diagnostics.data.azurerm_monitor_diagnostic_categories.resources["firewall-hub"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "resources" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.hub.module.diagnostics.data.azurerm_monitor_diagnostic_categories.resources["vnet-hub"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "resources" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.hub.module.diagnostics.azurerm_monitor_diagnostic_setting.rule["bastion"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "rule" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "AzureDiagnostics"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "bastion-diagnostic-setting"
      + target_resource_id             = (known after apply)

      + enabled_log (known after apply)

      + metric (known after apply)
    }

  # module.hub.module.diagnostics.azurerm_monitor_diagnostic_setting.rule["firewall-hub"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "rule" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "AzureDiagnostics"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "firewall-hub-diagnostic-setting"
      + target_resource_id             = (known after apply)

      + enabled_log (known after apply)

      + metric (known after apply)
    }

  # module.hub.module.diagnostics.azurerm_monitor_diagnostic_setting.rule["vnet-hub"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "rule" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "AzureDiagnostics"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "vnet-hub-diagnostic-setting"
      + target_resource_id             = (known after apply)

      + enabled_log (known after apply)

      + metric (known after apply)
    }

  # module.hub.module.firewall.azurerm_firewall.firewall will be created
  + resource "azurerm_firewall" "firewall" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "fw-dev-eus"
      + resource_group_name = "rg-erictfpoc-hub-dev-eus"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Basic"
      + threat_intel_mode   = (known after apply)
      + zones               = [
          + "1",
        ]

      + ip_configuration {
          + name                 = "configuration"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }

      + management_ip_configuration {
          + name                 = "mgmtconfig"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.hub.module.firewall.azurerm_firewall_policy.firewallPolicy will be created
  + resource "azurerm_firewall_policy" "firewallPolicy" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "fwp-dev-eus"
      + resource_group_name      = "rg-erictfpoc-hub-dev-eus"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Basic"
      + threat_intelligence_mode = "Alert"
    }

  # module.hub.module.firewall.azurerm_firewall_policy_rule_collection_group.policyGroup["policy-rules-collection"] will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "policyGroup" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "policy-rules-collection"
      + priority           = 1000

      + application_rule_collection {
          + action   = "Allow"
          + name     = "ace-general-allow-rules"
          + priority = 110

          + rule {
              + destination_addresses = []
              + destination_fqdns     = [
                  + "mcr.microsoft.com",
                  + "*.data.mcr.microsoft.com",
                  + "*.blob.core.windows.net",
                ]
              + name                  = "ace-general-allow-rules"
              + source_addresses      = [
                  + "10.1.0.0/27",
                ]
              + source_ip_groups      = []

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_addresses = []
              + destination_fqdns     = [
                  + "*.blob.core.windows.net",
                  + "login.microsoft.com",
                  + "*.azurecr.io",
                  + "hub.docker.com",
                  + "registry-1.docker.io",
                  + "production.cloudflare.docker.com",
                  + "index.docker.io",
                  + "auth.docker.io",
                ]
              + name                  = "ace-acr-and-docker-allow-rules"
              + source_addresses      = [
                  + "10.1.0.0/27",
                ]
              + source_ip_groups      = []

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_addresses = []
              + destination_fqdns     = [
                  + "*.identity.azure.net",
                  + "login.microsoftonline.com",
                  + "*.login.microsoftonline.com",
                  + "*.login.microsoft.com",
                ]
              + name                  = "ace-managed-identity-allow-rules"
              + source_addresses      = [
                  + "10.1.0.0/27",
                ]
              + source_ip_groups      = []

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_addresses = []
              + destination_fqdns     = [
                  + "*.vault.azure.net",
                  + "login.microsoft.com",
                ]
              + name                  = "ace-keyvault-allow-rules"
              + source_addresses      = [
                  + "10.1.0.0/27",
                ]
              + source_ip_groups      = []

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }
      + application_rule_collection {
          + action   = "Allow"
          + name     = "allow-azure-monitor"
          + priority = 120

          + rule {
              + destination_addresses = []
              + destination_fqdns     = [
                  + "dc.applicationinsights.azure.com",
                  + "dc.applicationinsights.microsoft.com",
                  + "dc.services.visualstudio.com",
                  + "*.in.applicationinsights.azure.com",
                  + "live.applicationinsights.azure.com",
                  + "rt.applicationinsights.microsoft.com",
                  + "rt.services.visualstudio.com",
                  + "*.livediagnostics.monitor.azure.com",
                  + "*.monitoring.azure.com",
                  + "agent.azureserviceprofiler.net",
                  + "*.agent.azureserviceprofiler.net",
                  + "*.monitor.azure.com",
                ]
              + name                  = "allow-azure-monitor"
              + source_addresses      = [
                  + "10.1.0.0/27",
                ]
              + source_ip_groups      = []

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }
      + application_rule_collection {
          + action   = "Allow"
          + name     = "allow-core-dev-fqdn"
          + priority = 130

          + rule {
              + destination_addresses = []
              + destination_fqdns     = [
                  + "github.com",
                  + "*.github.com",
                  + "ghcr.io",
                  + "*.ghcr.io",
                  + "*.nuget.org",
                  + "*.blob.core.windows.net",
                  + "*.table.core.windows.net",
                  + "*.servicebus.windows.net",
                  + "githubusercontent.com",
                  + "*.githubusercontent.com",
                  + "dev.azure.com",
                  + "portal.azure.com",
                  + "*.portal.azure.com",
                  + "*.portal.azure.net",
                  + "appservice.azureedge.net",
                  + "*.azurewebsites.net",
                ]
              + name                  = "allow-developer-services"
              + source_addresses      = [
                  + "10.1.0.0/27",
                ]
              + source_ip_groups      = []

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_addresses = []
              + destination_fqdns     = [
                  + "*.delivery.mp.microsoft.com",
                  + "ctldl.windowsupdate.com",
                  + "ocsp.msocsp.com",
                  + "oneocsp.microsoft.com",
                  + "crl.microsoft.com",
                  + "www.microsoft.com",
                  + "*.digicert.com",
                  + "*.symantec.com",
                  + "*.symcb.com",
                  + "*.d-trust.net",
                ]
              + name                  = "allow-certificate-dependencies"
              + source_addresses      = [
                  + "10.1.0.0/27",
                ]
              + source_ip_groups      = []

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }

      + network_rule_collection {
          + action   = "Allow"
          + name     = "ace-allow-rules"
          + priority = 100

          + rule {
              + destination_addresses = [
                  + "MicrosoftContainerRegistry",
                  + "AzureFrontDoor.FirstParty",
                ]
              + destination_fqdns     = []
              + destination_ip_groups = []
              + destination_ports     = [
                  + "443",
                ]
              + name                  = "ace-general-allow-rule"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.1.0.0/27",
                ]
              + source_ip_groups      = []
            }
          + rule {
              + destination_addresses = [
                  + "AzureContainerRegistry",
                  + "AzureActiveDirectory",
                ]
              + destination_fqdns     = []
              + destination_ip_groups = []
              + destination_ports     = [
                  + "443",
                ]
              + name                  = "ace-acr-allow-rule"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.1.0.0/27",
                ]
              + source_ip_groups      = []
            }
          + rule {
              + destination_addresses = [
                  + "AzureKeyVault",
                  + "AzureActiveDirectory",
                ]
              + destination_fqdns     = []
              + destination_ip_groups = []
              + destination_ports     = [
                  + "443",
                ]
              + name                  = "ace-keyvault-allow-rule"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.1.0.0/27",
                ]
              + source_ip_groups      = []
            }
          + rule {
              + destination_addresses = [
                  + "AzureActiveDirectory",
                ]
              + destination_fqdns     = []
              + destination_ip_groups = []
              + destination_ports     = [
                  + "443",
                ]
              + name                  = "ace-managedIdentity-allow-rule"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.1.0.0/27",
                ]
              + source_ip_groups      = []
            }
        }
    }

  # module.hub.module.firewall.azurerm_public_ip.publicIpFirewall will be created
  + resource "azurerm_public_ip" "publicIpFirewall" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "pip-fw-dev-eus"
      + resource_group_name     = "rg-erictfpoc-hub-dev-eus"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + zones                   = [
          + "1",
        ]
    }

  # module.hub.module.firewall.azurerm_public_ip.publicIpFirewallManagement will be created
  + resource "azurerm_public_ip" "publicIpFirewallManagement" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "pip-fw-dev-eus-management"
      + resource_group_name     = "rg-erictfpoc-hub-dev-eus"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + zones                   = [
          + "1",
        ]
    }

  # module.hub.module.logAnalyticsWorkspace.azurerm_log_analytics_workspace.laws will be created
  + resource "azurerm_log_analytics_workspace" "laws" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "log-erictfpoc-dev-eus"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-erictfpoc-hub-dev-eus"
      + retention_in_days               = 90
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # module.hub.module.vnet.azurerm_subnet.subnets["AzureFirewallManagementSubnet"] will be created
  + resource "azurerm_subnet" "subnets" {
      + address_prefixes                              = [
          + "10.0.0.192/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallManagementSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-erictfpoc-hub-dev-eus"
      + virtual_network_name                          = "vnet-dev-eus-hub"
    }

  # module.hub.module.vnet.azurerm_subnet.subnets["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "subnets" {
      + address_prefixes                              = [
          + "10.0.0.64/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-erictfpoc-hub-dev-eus"
      + virtual_network_name                          = "vnet-dev-eus-hub"
    }

  # module.hub.module.vnet.azurerm_subnet.subnets["GatewaySubnet"] will be created
  + resource "azurerm_subnet" "subnets" {
      + address_prefixes                              = [
          + "10.0.0.0/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-erictfpoc-hub-dev-eus"
      + virtual_network_name                          = "vnet-dev-eus-hub"
    }

  # module.hub.module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/24",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vnet-dev-eus-hub"
      + resource_group_name = "rg-erictfpoc-hub-dev-eus"
      + subnet              = (known after apply)
    }

  # module.spoke.module.diagnostics.data.azurerm_monitor_diagnostic_categories.resources["vm-jumpbox"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "resources" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.spoke.module.diagnostics.data.azurerm_monitor_diagnostic_categories.resources["vnet-spoke"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "resources" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.spoke.module.diagnostics.azurerm_monitor_diagnostic_setting.rule["vm-jumpbox"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "rule" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "AzureDiagnostics"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "vm-jumpbox-diagnostic-setting"
      + target_resource_id             = (known after apply)

      + enabled_log (known after apply)

      + metric (known after apply)
    }

  # module.spoke.module.diagnostics.azurerm_monitor_diagnostic_setting.rule["vnet-spoke"] will be created
  + resource "azurerm_monitor_diagnostic_setting" "rule" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "AzureDiagnostics"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "vnet-spoke-diagnostic-setting"
      + target_resource_id             = (known after apply)

      + enabled_log (known after apply)

      + metric (known after apply)
    }

  # module.spoke.module.logAnalyticsWorkspace.azurerm_log_analytics_workspace.laws will be created
  + resource "azurerm_log_analytics_workspace" "laws" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "log-erictfpoc-dev-eus"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-erictfpoc-spoke-dev-eus"
      + retention_in_days               = 90
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # module.spoke.module.nsgAppGateway.azurerm_network_security_group.securityGroup will be created
  + resource "azurerm_network_security_group" "securityGroup" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-agw-erictfpoc-dev-eus"
      + resource_group_name = "rg-erictfpoc-spoke-dev-eus"
      + security_rule       = (known after apply)
    }

  # module.spoke.module.nsgAppGateway.azurerm_network_security_rule.rules["Allow_AzureLoadBalancer"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "allow AzureLoadBalancer incoming connections"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "80",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow_AzureLoadBalancer"
      + network_security_group_name = "nsg-agw-erictfpoc-dev-eus"
      + priority                    = 130
      + protocol                    = "*"
      + resource_group_name         = "rg-erictfpoc-spoke-dev-eus"
      + source_address_prefix       = "AzureLoadBalancer"
      + source_port_range           = "*"
    }

  # module.spoke.module.nsgAppGateway.azurerm_network_security_rule.rules["Allow_HTTP"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "allow http incoming connections"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "80",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow_HTTP"
      + network_security_group_name = "nsg-agw-erictfpoc-dev-eus"
      + priority                    = 120
      + protocol                    = "*"
      + resource_group_name         = "rg-erictfpoc-spoke-dev-eus"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.spoke.module.nsgAppGateway.azurerm_network_security_rule.rules["Allow_TLS"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "allow https incoming connections"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "443",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow_TLS"
      + network_security_group_name = "nsg-agw-erictfpoc-dev-eus"
      + priority                    = 110
      + protocol                    = "*"
      + resource_group_name         = "rg-erictfpoc-spoke-dev-eus"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.spoke.module.nsgAppGateway.azurerm_network_security_rule.rules["HealthProbes"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allow HealthProbes from gateway Manager."
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "65200-65535",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "HealthProbes"
      + network_security_group_name = "nsg-agw-erictfpoc-dev-eus"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "rg-erictfpoc-spoke-dev-eus"
      + source_address_prefix       = "GatewayManager"
      + source_port_range           = "*"
    }

  # module.spoke.module.nsgContainerAppsEnvironmentNsg.azurerm_network_security_group.securityGroup will be created
  + resource "azurerm_network_security_group" "securityGroup" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-cae-erictfpoc-dev-eus"
      + resource_group_name = "rg-erictfpoc-spoke-dev-eus"
      + security_rule       = (known after apply)
    }

  # module.spoke.module.nsgContainerAppsEnvironmentNsg.azurerm_network_security_rule.rules["Allow_Azure_Monitor"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allows outbound calls to Azure Monitor."
      + destination_address_prefix  = "AzureCloud.eastus"
      + destination_port_ranges     = [
          + "443",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow_Azure_Monitor"
      + network_security_group_name = "nsg-cae-erictfpoc-dev-eus"
      + priority                    = 120
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-erictfpoc-spoke-dev-eus"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.spoke.module.nsgContainerAppsEnvironmentNsg.azurerm_network_security_rule.rules["Allow_Container_Apps_control_plane"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Container Apps control plane"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "5671",
          + "5672",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow_Container_Apps_control_plane"
      + network_security_group_name = "nsg-cae-erictfpoc-dev-eus"
      + priority                    = 150
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-erictfpoc-spoke-dev-eus"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.spoke.module.nsgContainerAppsEnvironmentNsg.azurerm_network_security_rule.rules["Allow_Internal_AKS_Connection_Between_Nodes_And_Control_Plane_TCP"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "internal AKS secure connection between underlying nodes and control plane.."
      + destination_address_prefix  = "AzureCloud.eastus"
      + destination_port_ranges     = [
          + "9000",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow_Internal_AKS_Connection_Between_Nodes_And_Control_Plane_TCP"
      + network_security_group_name = "nsg-cae-erictfpoc-dev-eus"
      + priority                    = 110
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-erictfpoc-spoke-dev-eus"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.spoke.module.nsgContainerAppsEnvironmentNsg.azurerm_network_security_rule.rules["Allow_Internal_AKS_Connection_Between_Nodes_And_Control_Plane_UDP"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "internal AKS secure connection between underlying nodes and control plane.."
      + destination_address_prefix  = "AzureCloud.eastus"
      + destination_port_ranges     = [
          + "1194",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow_Internal_AKS_Connection_Between_Nodes_And_Control_Plane_UDP"
      + network_security_group_name = "nsg-cae-erictfpoc-dev-eus"
      + priority                    = 100
      + protocol                    = "Udp"
      + resource_group_name         = "rg-erictfpoc-spoke-dev-eus"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.spoke.module.nsgContainerAppsEnvironmentNsg.azurerm_network_security_rule.rules["Allow_NTP_Server"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "NTP server"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "123",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow_NTP_Server"
      + network_security_group_name = "nsg-cae-erictfpoc-dev-eus"
      + priority                    = 140
      + protocol                    = "Udp"
      + resource_group_name         = "rg-erictfpoc-spoke-dev-eus"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.spoke.module.nsgContainerAppsEnvironmentNsg.azurerm_network_security_rule.rules["Allow_Outbound_443"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "Allowing all outbound on port 443 provides a way to allow all FQDN based outbound dependencies that don't have a static IP"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "443",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "Allow_Outbound_443"
      + network_security_group_name = "nsg-cae-erictfpoc-dev-eus"
      + priority                    = 130
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-erictfpoc-spoke-dev-eus"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.spoke.module.nsgJumpbox.azurerm_network_security_group.securityGroup will be created
  + resource "azurerm_network_security_group" "securityGroup" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-vm-dev-eus"
      + resource_group_name = "rg-erictfpoc-spoke-dev-eus"
      + security_rule       = (known after apply)
    }

  # module.spoke.module.nsgPrivateEndpoints.azurerm_network_security_group.securityGroup will be created
  + resource "azurerm_network_security_group" "securityGroup" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-pep-erictfpoc-dev-eus"
      + resource_group_name = "rg-erictfpoc-spoke-dev-eus"
      + security_rule       = (known after apply)
    }

  # module.spoke.module.peeringHubToSpoke.azurerm_virtual_network_peering.peering will be created
  + resource "azurerm_virtual_network_peering" "peering" {
      + allow_forwarded_traffic                = false
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = (known after apply)
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = (known after apply)
      + use_remote_gateways                    = false
      + virtual_network_name                   = (known after apply)
    }

  # module.spoke.module.peeringSpokeToHub.azurerm_virtual_network_peering.peering will be created
  + resource "azurerm_virtual_network_peering" "peering" {
      + allow_forwarded_traffic                = false
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = (known after apply)
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rg-erictfpoc-spoke-dev-eus"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnet-erictfpoc-dev-eus-spoke"
    }

  # module.spoke.module.routeTable.azurerm_route.routeToFirewall["defaultEgressLockdown"] will be created
  + resource "azurerm_route" "routeToFirewall" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "defaultEgressLockdown"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "rg-erictfpoc-spoke-dev-eus"
      + route_table_name       = "rt-erictfpoc-dev-eus"
    }

  # module.spoke.module.routeTable.azurerm_route_table.rt will be created
  + resource "azurerm_route_table" "rt" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "rt-erictfpoc-dev-eus"
      + resource_group_name           = "rg-erictfpoc-spoke-dev-eus"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
    }

  # module.spoke.module.routeTable.azurerm_subnet_route_table_association.associationRtSubnetInfra will be created
  + resource "azurerm_subnet_route_table_association" "associationRtSubnetInfra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke.module.vm.azurerm_linux_virtual_machine.linuxVm[0] will be created
  + resource "azurerm_linux_virtual_machine" "linuxVm" {
      + admin_username                                         = "vmadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "vm-dev-eus"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-erictfpoc-spoke-dev-eus"
      + size                                                   = "Standard_B2ms"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC4QdKjrROyGo0J0BWseohjcWhYqlhBR0n5HqEkoJ0AD52caHqQ+45b3itHD518x6yai7ALvyCHR2gmVtV0jXzN+/oUgoaHAm3RbSAtFZdz0BUB4NlMllpWSbOk5liu+jmL+ajUu6OtsS15biWeRey3br25WroBED07IMqFGnqHqE2VDEFhct1W7T14ajd+qBl7riBm0xVzUhhdG1AJkmOgHxvr3KzRWbjfKc/ZsYdgKJ4acOdpcDUiK6A72Sw2dou/PYk0dR/kHx/SegWqsiiJP53KK2fNlN73dbP2zeRVSbfTNKYbtQkXdHutZQwWKqlS+uygrcvapjGMAJZo1BMLzMh0CsZzOorKq4m7eSHlS8adixP5KsiQUJZdrhWkJOYs5UOUeg/W8HvieTOVW3WOkHry55koOp0o1X9Ac/DA6frTJz0iINW3UuzSlRpYC/Lr5kYeYRTJLV7OAF/YICVieEx72ULgE8hpogLnEPx2+L00s3WngU+CdG0QYUJMLXU= generated-by-azure"
          + username   = "vmadmin"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "Canonical"
          + sku       = "20_04-lts-gen2"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.spoke.module.vm.azurerm_network_interface.vmNic will be created
  + resource "azurerm_network_interface" "vmNic" {
      + applied_dns_servers         = (known after apply)
      + id                          = (known after apply)
      + internal_domain_name_suffix = (known after apply)
      + location                    = "eastus"
      + mac_address                 = (known after apply)
      + name                        = "nic-vm-dev-eus"
      + private_ip_address          = (known after apply)
      + private_ip_addresses        = (known after apply)
      + resource_group_name         = "rg-erictfpoc-spoke-dev-eus"
      + virtual_machine_id          = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.spoke.module.vm.azurerm_virtual_machine_extension.vm_extension_linux[0] will be created
  + resource "azurerm_virtual_machine_extension" "vm_extension_linux" {
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "vm-extension-linux"
      + publisher                   = "Microsoft.Azure.Extensions"
      + settings                    = <<-EOT
            {
                  "script": "IyEvYmluL2Jhc2gKCiMgU2NyaXB0IERlZmluaXRpb24KbG9ncGF0aD0vdmFyL2xvZy9kZXBsb3ltZW50c2NyaXB0bG9nCgojIFVwZ3JhZGluZyBMaW51eCBEaXN0cmlidXRpb24KZWNobyAiIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMiID4+ICRsb2dwYXRoCmVjaG8gIlVwZ3JhZGluZyBMaW51eCBEaXN0cmlidXRpb24iID4+ICRsb2dwYXRoCmVjaG8gIiMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIiA+PiAkbG9ncGF0aApzdWRvIGFwdC1nZXQgdXBkYXRlID4+ICRsb2dwYXRoCnN1ZG8gYXB0LWdldCAteSB1cGdyYWRlID4+ICRsb2dwYXRoCmVjaG8gIiAiID4+ICRsb2dwYXRoCgojIEluc3RhbGwgQXp1cmUgQ0xJCmVjaG8gIiMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIiA+PiAkbG9ncGF0aAplY2hvICJJbnN0YWxsaW5nIEF6dXJlIENMSSIgPj4gJGxvZ3BhdGgKZWNobyAiIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMiID4+ICRsb2dwYXRoCmN1cmwgLXNMIGh0dHBzOi8vYWthLm1zL0luc3RhbGxBenVyZUNMSURlYiB8IHN1ZG8gYmFzaAoKIyBJbnN0YWxsIERvY2tlcgplY2hvICIjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyIgPj4gJGxvZ3BhdGgKZWNobyAiSW5zdGFsbGluZyBEb2NrZXIiID4+ICRsb2dwYXRoCmVjaG8gIiMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIiA+PiAkbG9ncGF0aAp3Z2V0IC1xTy0gaHR0cHM6Ly9nZXQuZG9ja2VyLmNvbS8gfCBzaCA+PiAkbG9ncGF0aApzdWRvIHVzZXJtb2QgLWFHIGRvY2tlciAkMQplY2hvICIgIiA+PiAkbG9ncGF0aAoKCiMgaW5zdGFsbCBUZXJyYWZvcm0gQ0xJCiMgaHR0cHM6Ly9sZWFybi5oYXNoaWNvcnAuY29tL3R1dG9yaWFscy90ZXJyYWZvcm0vaW5zdGFsbC1jbGkKZWNobyAiIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMiID4+ICRsb2dwYXRoCmVjaG8gIkluc3RhbGxpbmcgVGVycmFmb3JtIiA+PiAkbG9ncGF0aAplY2hvICIjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyMjIyIgPj4gJGxvZ3BhdGgKCndnZXQgLU8tIGh0dHBzOi8vYXB0LnJlbGVhc2VzLmhhc2hpY29ycC5jb20vZ3BnIHwgc3VkbyBncGcgLS1kZWFybW9yIC1vIC91c3Ivc2hhcmUva2V5cmluZ3MvaGFzaGljb3JwLWFyY2hpdmUta2V5cmluZy5ncGcKZWNobyAiZGViIFtzaWduZWQtYnk9L3Vzci9zaGFyZS9rZXlyaW5ncy9oYXNoaWNvcnAtYXJjaGl2ZS1rZXlyaW5nLmdwZ10gaHR0cHM6Ly9hcHQucmVsZWFzZXMuaGFzaGljb3JwLmNvbSAkKGxzYl9yZWxlYXNlIC1jcykgbWFpbiIgfCBzdWRvIHRlZSAvZXRjL2FwdC9zb3VyY2VzLmxpc3QuZC9oYXNoaWNvcnAubGlzdApzdWRvIGFwdCB1cGRhdGUgJiYgc3VkbyBhcHQgaW5zdGFsbCB0ZXJyYWZvcm0KCnRlcnJhZm9ybSB2ZXJzaW9u"
                }
        EOT
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = (known after apply)
    }

  # module.spoke.module.vm.random_password.password[0] will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.spoke.module.vm.random_password.password[1] will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.spoke.module.vnet.azurerm_subnet.subnets["snet-agw"] will be created
  + resource "azurerm_subnet" "subnets" {
      + address_prefixes                              = [
          + "10.1.3.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-agw"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-erictfpoc-spoke-dev-eus"
      + virtual_network_name                          = "vnet-erictfpoc-dev-eus-spoke"
    }

  # module.spoke.module.vnet.azurerm_subnet.subnets["snet-infra"] will be created
  + resource "azurerm_subnet" "subnets" {
      + address_prefixes                              = [
          + "10.1.0.0/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-infra"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-erictfpoc-spoke-dev-eus"
      + virtual_network_name                          = "vnet-erictfpoc-dev-eus-spoke"

      + delegation {
          + name = "Microsoft.App/environments"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.App/environments"
            }
        }
    }

  # module.spoke.module.vnet.azurerm_subnet.subnets["snet-jumpbox"] will be created
  + resource "azurerm_subnet" "subnets" {
      + address_prefixes                              = [
          + "10.1.2.32/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-jumpbox"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-erictfpoc-spoke-dev-eus"
      + virtual_network_name                          = "vnet-erictfpoc-dev-eus-spoke"
    }

  # module.spoke.module.vnet.azurerm_subnet.subnets["snet-pep"] will be created
  + resource "azurerm_subnet" "subnets" {
      + address_prefixes                              = [
          + "10.1.2.0/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-pep"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-erictfpoc-spoke-dev-eus"
      + virtual_network_name                          = "vnet-erictfpoc-dev-eus-spoke"
    }

  # module.spoke.module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.1.0.0/22",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vnet-erictfpoc-dev-eus-spoke"
      + resource_group_name = "rg-erictfpoc-spoke-dev-eus"
      + subnet              = (known after apply)
    }

  # module.hub.module.bastion.module.nsg.azurerm_network_security_group.securityGroup will be created
  + resource "azurerm_network_security_group" "securityGroup" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-bas-dev-eus"
      + resource_group_name = "rg-erictfpoc-hub-dev-eus"
      + security_rule       = (known after apply)
    }

  # module.hub.module.bastion.module.nsg.azurerm_network_security_rule.rules["AllowAzureCloudOutbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "AllowAzureCloudOutbound"
      + destination_address_prefix  = "AzureCloud"
      + destination_port_ranges     = [
          + "443",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "AllowAzureCloudOutbound"
      + network_security_group_name = "nsg-bas-dev-eus"
      + priority                    = 110
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-erictfpoc-hub-dev-eus"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.hub.module.bastion.module.nsg.azurerm_network_security_rule.rules["AllowAzureLoadBalancerInbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "AllowAzureLoadBalancerInbound"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "443",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowAzureLoadBalancerInbound"
      + network_security_group_name = "nsg-bas-dev-eus"
      + priority                    = 140
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-erictfpoc-hub-dev-eus"
      + source_address_prefix       = "AzureLoadBalancer"
      + source_port_range           = "*"
    }

  # module.hub.module.bastion.module.nsg.azurerm_network_security_rule.rules["AllowBastionCommunication"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "AllowBastionCommunication"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_ranges     = [
          + "5701",
          + "8080",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "AllowBastionCommunication"
      + network_security_group_name = "nsg-bas-dev-eus"
      + priority                    = 120
      + protocol                    = "*"
      + resource_group_name         = "rg-erictfpoc-hub-dev-eus"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.hub.module.bastion.module.nsg.azurerm_network_security_rule.rules["AllowBastionHostCommunicationInbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "AllowBastionHostCommunicationInbound"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_ranges     = [
          + "5701",
          + "8080",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowBastionHostCommunicationInbound"
      + network_security_group_name = "nsg-bas-dev-eus"
      + priority                    = 150
      + protocol                    = "*"
      + resource_group_name         = "rg-erictfpoc-hub-dev-eus"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.hub.module.bastion.module.nsg.azurerm_network_security_rule.rules["AllowGatewayManagerInbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "AllowGatewayManagerInbound"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "443",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowGatewayManagerInbound"
      + network_security_group_name = "nsg-bas-dev-eus"
      + priority                    = 130
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-erictfpoc-hub-dev-eus"
      + source_address_prefix       = "GatewayManager"
      + source_port_range           = "*"
    }

  # module.hub.module.bastion.module.nsg.azurerm_network_security_rule.rules["AllowGetSessionInformation"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "AllowGetSessionInformation"
      + destination_address_prefix  = "Internet"
      + destination_port_ranges     = [
          + "80",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "AllowGetSessionInformation"
      + network_security_group_name = "nsg-bas-dev-eus"
      + priority                    = 130
      + protocol                    = "*"
      + resource_group_name         = "rg-erictfpoc-hub-dev-eus"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.hub.module.bastion.module.nsg.azurerm_network_security_rule.rules["AllowHttpsInbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "AllowHttpsInbound"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "443",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHttpsInbound"
      + network_security_group_name = "nsg-bas-dev-eus"
      + priority                    = 120
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-erictfpoc-hub-dev-eus"
      + source_address_prefix       = "Internet"
      + source_port_range           = "*"
    }

  # module.hub.module.bastion.module.nsg.azurerm_network_security_rule.rules["AllowSshRdpOutbound"] will be created
  + resource "azurerm_network_security_rule" "rules" {
      + access                      = "Allow"
      + description                 = "AllowSshRdpOutbound"
      + destination_address_prefix  = "VirtualNetwork"
      + destination_port_ranges     = [
          + "22",
          + "3389",
        ]
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "AllowSshRdpOutbound"
      + network_security_group_name = "nsg-bas-dev-eus"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "rg-erictfpoc-hub-dev-eus"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

Plan: 66 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hubResourceGroupName   = "rg-erictfpoc-hub-dev-eus"
  + spokeResourceGroupName = "rg-erictfpoc-spoke-dev-eus"
```
</details>